{"Error":"0","Time":0.0124,"Total":"1357","Page":1,"Books":[{"ID":2563063616,"Title":"The Modern Web","SubTitle":"Multi-Device Web Development with HTML5, CSS3, and JavaScript","Description":"Today's web technologies are evolving at near–light speed, bringing the promise of a seamless Internet ever closer to reality. When users can browse the Web on a three-inch phone screen as easily as on a fifty-inch HDTV, what's a developer to do? ...","Image":"http://s.it-ebooks-api.info/15/the_modern_web.jpg","isbn":"9781593274870"},{"ID":421958423,"Title":"Getting Started with Meteor.js JavaScript Framework","SubTitle":"Develop modern web applications in Meteor, one of the hottest new JavaScript platforms","Description":"Meteor is a brand new platform built entirely in JavaScript that allows you to build modern, dynamic web applications in the blink of an eye. With support for nearly every popular JavaScript framework (and more being added every day), Meteor provides ...","Image":"http://s.it-ebooks-api.info/14/getting_started_with_meteor.js_javascript_framework.jpg","isbn":"9781782160823"},{"ID":1425607065,"Title":"PHP Web Services","SubTitle":"APIs for the Modern Web","Description":"Whether you're sharing data between two internal systems or building an API so users can access their data, this practical book provides everything you need to build web service APIs with PHP. Author Lorna Jane Mitchell uses code samples, real-world ...","Image":"http://s.it-ebooks-api.info/3/php_web_services.jpg","isbn":"9781449356569"},{"ID":2082674516,"Title":"Web Development with Clojure","SubTitle":"Build Bulletproof Web Apps with Less Code","Description":"If the usual patchwork of web development tools and languages just isn't cutting it for you, you need Web Development With Clojure. Clojure gives you the rich infrastructure of the JVM with the expressive power of a modern functional language. It com ...","Image":"http://s.it-ebooks-api.info/1/web_development_with_clojure.jpg","isbn":"9781937785642"},{"ID":1114209070,"Title":"Seven Web Frameworks in Seven Weeks","SubTitle":"Adventures in Better Web Apps","Description":"Whether you need a new tool or just inspiration, Seven Web Frameworks in Seven Weeks explores modern options, giving you a taste of each with ideas that will help you create better apps. You'll see frameworks that leverage modern programming language ...","Image":"http://s.it-ebooks-api.info/1/seven_web_frameworks_in_seven_weeks.jpg","isbn":"9781937785635"},{"ID":86577716,"Title":"Web App Testing Using Knockout.JS","SubTitle":"Design, implement, and maintain a fully tested JavaScript web application using Knockout.JS","Description":"As modern web applications grow in complexity and features, developers need tools and frameworks to deliver and maintain solutions with high quality standards. Knockout.JS is an emerging JavaScript presentation framework that promotes a solid solutio ...","Image":"http://s.it-ebooks-api.info/14/web_app_testing_using_knockout.js.jpg","isbn":"9781783982844"},{"ID":113112775,"Title":"Web Scraping with Python","SubTitle":"Collecting Data from the Modern Web","Description":"Learn web scraping and crawling techniques to access unlimited data from any web source in any format. With this practical guide, you'll learn how to use Python scripts and web APIs to gather and process data from thousands - or even millions - of we ...","Image":"http://s.it-ebooks-api.info/3/web_scraping_with_python.jpg","isbn":"9781491910290"},{"ID":1110777260,"Title":"Ember.js Web Development with Ember CLI","SubTitle":"Build ambitious single-page web applications using the power of Ember.js and Ember CLI","Description":"Ember.js is a JavaScript framework based on the Model View Controller design pattern. It brings proven design principles and practices to modern web-based application development and helps you focus on solving your core business problem.\n\nEmber.js ...","Image":"http://s.it-ebooks-api.info/14/ember.js_web_development_with_ember_cli.jpg","isbn":"9781784395841"},{"ID":2750793305,"Title":"Mastering Dojo","SubTitle":"JavaScript and Ajax Tools for Great Web Experiences","Description":"Imagine a true thin-client web application environment, with no browser incompatibilities, no plugins, and an interface that's closer to a desktop app. You can have it all, today. Welcome to The Dojo Toolkit.\n\nMastering Dojo walks you through the w ...","Image":"http://s.it-ebooks-api.info/1/mastering_dojo.jpg","isbn":"9781934356111"},{"ID":2424418435,"Title":"Web Development Recipes","Description":"Modern web development takes more than just HTML and CSS with a little JavaScript mixed in. Clients want more responsive sites with faster interfaces that work on multiple devices, and you need the latest tools and techniques to make that happen. Thi ...","Image":"http://s.it-ebooks-api.info/1/web_development_recipes.jpg","isbn":"9781934356838"}]}